<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"695d6e304d017bd91d0d5db07e7ac29a608d84bb3be7d3b710f81bb3b3af27c6","plan_job_ref":"Job Test OpenTofu early eval #25 at https://github.com/dflook/terraform-github-actions/actions/runs/15306967380","plan_out_hash":"fdcf48928589bb7c6da733440dae8a4bac13a3de7a48e0d9f45d4a4a329277e6","plan_hash":"b811e1a83b2c8cff9729fba815bdf7070539b4f9b230eb3c22868a37d489a1e3","plan_text_format":"diff","version":"99.0.0"} -->
OpenTofu plan in __tests/workflows/test-early-eval/s3__
With variables: `passphrase = (sensitive value)`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.s3-bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3-bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test OpenTofu early eval #25](https://github.com/dflook/terraform-github-actions/actions/runs/15306967380)